/* Лабораторная работа №7
 * на тему: Исследование в С++ многопоточности, ошибок, отладки блоков кода в IDE Qt Creator?
 * Цели работы:
 * 1. Закрепить на практике представление о процессе, потоках, ошибках и отладки блоков кода.
 * 2. Научиться создавать программу с несколькими потоками языка С++.
 * Developer Zvorygin Artem
*/

#include  "main.h"

int main()
{
#if(TASK==1)
    task1();
#endif
#if(TASK==2)
    task2();
#endif
#if(TASK==3)
    task3();
#endif
#if(TASK==4)
    task4();
#endif
#if(TASK==5)
    task5();
#endif
};

